# индексы и срезы

a = [2, 3, 5, 7, 11, 13, 17, 19]

n = 4
print(f"a[{n}] = {a[n]}")

print(f"последний элемент", a[-1])
print(f"предпоследний элемент", a[-2])

print("первые 3 элемента", a[:3])
print(a[0], a[:1])

print("последние 3 элемента", a[-3:])

print("с 3-го по индексу, доконца", a[3:])

print("с 3-го по 6 по индексу", a[3:7])


print("в обратном порядке", a[::-1])
print("четные по интдексу", a[::2])
print("не четные по индексу", a[1::2])

a[2:5] = 100, 200
print(a)

a[3:3] = [1000, 2000]
print(a)
